{
  "name": "Process 1-Opening",
  "category": "anvilcraft:process",
  "icon": "anvilcraft:geode",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "This mod is very iron-intensive. In addition to building vanilla iron golem farm, this mod provides ways to quickly obtain basic ores. It starts with $(item)Amethyst$(). $(item)Geode$() is your good partner at the beginning. If you open the reward chest, then you can find some in the reward chest. If there is no reward chest, mining $(item)Budding Amethyst$() will also drop geodes. One of the functions of the geode is to help you find the amethyst geode(feature)."
    },
    {
      "type": "patchouli:spotlight",
      "item": "anvilcraft:geode",
      "text": "Right-click to locate a nearby amethyst geode. You can get amethyst shards and one of the following three gems when smashing the geode with an anvil on $(item)Stamping Platform$(): $(item)Topaz$(), $(item)Ruby$() and $(item)Sapphire$(). In subsequent game step, you can also use the time-warp to change it back to $(item)Budding Amethyst$(). Jeweler villagers also trade geodes."
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:amethyst_shard",
      "text": "Use $(item)Amethyst Shards$() to make some tools. They're more durable than iron tools, and they come with enchantments that can help you grow quickly early in the game."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "anvilcraft:amethyst_pickaxe",
      "text": "The $(item)Amethyst Pickaxe$() has Fortune III, which can help you get more iron ores, but it is mined at a lower level than the iron pickaxe."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "anvilcraft:amethyst_axe",
      "text": "The $(item)Amethyst Axe$() has Felling I. It's a new enchantment added to the mod that can break 2 additional connected logs per level, up to a maximum of III."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "anvilcraft:amethyst_shovel",
      "text": "The $(item)Amethyst Shovel$() has Efficiency III, which can help you prepare the ground faster."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "anvilcraft:amethyst_hoe",
      "text": "The $(item)Amethyst Hoe$() has Harvest I. It's a new enchantment added to the mod. Right-click ripe crops to harvest crops and replant them, and each level can harvest an additional lap of radius, capped at III."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "anvilcraft:amethyst_sword",
      "text": "The $(item)Amethyst Sword$() has Beheading I. It's a new enchantment added to the mod. Each level increases the chance of some mobs dropping heads, capped at III. For the player and the ender dragon, the probability is very high."
    }
  ]
}
